src/Catalogs/СкидкиНаценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СкидкиНаценки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантСовместногоПримененияСкидокНаценок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСовместногоПримененияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСравненияУсловия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСкидкиНаценкиОбъектом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыБонусныхСчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеУсловия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеУсловия2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоНазначения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеБонусами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеНачислятьБонусПриНаличииСкидки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНакопления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектНакопления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНакопления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНакопленияТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокПрименения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакИспользованиеВыклПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакИспользованиеНаУсмотрение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментБазыРасчетаСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаНаЕдиныйКомплект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПредоставленияСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособПредоставленияСкидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПолучателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПолучателейСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеПредоставленияСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияПредоставленияСкидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСуммироватьЛицевыеСчетаРодственников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промокод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Промокоды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВремяПоДнямНедели</Name>
					<Comment>(Общ) Время действия скидки</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Comment>(Общ) Время начала действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Comment>(Общ) Время окончания действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Comment>(Общ) Признак выбранного дня недели</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Comment>(Общ) День недели</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборПодарков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборПокупкиДляПолученияПодарков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКарт</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.Карты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ДействиеСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДействиеСкидокНаценок</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрименений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПримененийПоКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>Клиника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкидкаНаценка</Name>
					<Comment>Скидка наценка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КонтрагентыСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КонтрагентыСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Промокоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Промокоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Промокод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Промокоды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыПолучателейСкидкиНаценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПолучателейСкидкиНаценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОграниченоВидамиДисконтныхКарт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграниченоСегментомКлиентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграниченоСпискомКлиентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиентРекламныйИсточник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/УсловияПредоставленияСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>УсловияПредоставленияСкидки</Name>
			<Comment>Вариант условия предоставления скидки</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Всегда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДеньРождения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредыдущийПрием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерПокупки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстатокНаЛицевомСчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Промокод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусРефералу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СкидкиНаценки/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

// Процедура - Обработка получения представления
//
// Параметры:
//  Данные				 - 	 - 
//  Представление		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Представление = ?(Данные.НачислениеБонусами = Истина, НСтр("ru = 'Бонус: '; en = 'Bonus: '"), НСтр("ru = 'Скидка: '; en = 'Discount: '")) + Данные.Наименование;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    Поля.Добавить("Наименование");
	Поля.Добавить("НачислениеБонусами");
	Поля.Добавить("ЭтоГруппа");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получить таблицу параметров скидки/наценки
Функция ПолучитьСкидкиДоступныеДляКлиента(Клиент) Экспорт
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка КАК Скидка,
	|	ДействиеСкидокНаценокСрезПоследних.ДатаНачала КАК ДатаНачала,
	|	ДействиеСкидокНаценокСрезПоследних.ДатаОкончания КАК ДатаОкончания,
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя КАК ТипПолучателя,
	|	ВЫБОР
	|		КОГДА ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя = ЗНАЧЕНИЕ(Перечисление.ТипыПолучателейСкидкиНаценки.ОграниченоСпискомКлиентов)
	|			ТОГДА ""Персональная""
	|		ИНАЧЕ ""Общая""
	|	КОНЕЦ КАК ТипСкидки,
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.СпособПредоставленияСкидки КАК СпособПредоставления,
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.Наименование КАК Представление
	|ПОМЕСТИТЬ втСкидки
	|ИЗ
	|	РегистрСведений.ДействиеСкидокНаценок.СрезПоследних(
	|			,
	|			ВЫБОР
	|					КОГДА ГОД(ДатаНачала) <> 1
	|						ТОГДА ДатаНачала <= &ТекущаяДата
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА ГОД(ДатаОкончания) <> 1
	|						ТОГДА ДатаОкончания >= &ТекущаяДата
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ДействиеСкидокНаценокСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СкидкиНаценки.Получатели КАК СкидкиНаценкиПолучатели
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
	|			ПО СкидкиНаценкиПолучатели.Получатель = КонтрагентыСегмента.Сегмент
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Карты КАК Карты
	|			ПО (Карты.Заблокирована = ЛОЖЬ)
	|				И СкидкиНаценкиПолучатели.Получатель = Карты.ВидКарты
	|		ПО ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка = СкидкиНаценкиПолучатели.Ссылка
	|			И (ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя = ЗНАЧЕНИЕ(Перечисление.ТипыПолучателейСкидкиНаценки.ОграниченоСегментомКлиентов)
	|				ИЛИ ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя = ЗНАЧЕНИЕ(Перечисление.ТипыПолучателейСкидкиНаценки.ОграниченоСпискомКлиентов)
	|				ИЛИ ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя = ЗНАЧЕНИЕ(Перечисление.ТипыПолучателейСкидкиНаценки.ОграниченоВидамиДисконтныхКарт))
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя = ЗНАЧЕНИЕ(Перечисление.ТипыПолучателейСкидкиНаценки.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			КОГДА ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя = ЗНАЧЕНИЕ(Перечисление.ТипыПолучателейСкидкиНаценки.ОграниченоСпискомКлиентов)
	|				ТОГДА СкидкиНаценкиПолучатели.Получатель = &Клиент
	|			КОГДА ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя = ЗНАЧЕНИЕ(Перечисление.ТипыПолучателейСкидкиНаценки.ОграниченоСегментомКлиентов)
	|				ТОГДА КонтрагентыСегмента.Контрагент = &Клиент
	|			КОГДА ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя = ЗНАЧЕНИЕ(Перечисление.ТипыПолучателейСкидкиНаценки.ОграниченоВидамиДисконтныхКарт)
	|				ТОГДА Карты.ВладелецКарты = &Клиент
	|		КОНЕЦ
	|	И ДействиеСкидокНаценокСрезПоследних.Актуальность = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка,
	|	ДействиеСкидокНаценокСрезПоследних.ДатаНачала,
	|	ДействиеСкидокНаценокСрезПоследних.ДатаОкончания,
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя,
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ЗначениеСкидкиНаценки,
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.СпособПредоставленияСкидки,
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Промокоды.Владелец КАК Владелец,
	|	Промокоды.Вид КАК Вид,
	|	Промокоды.Промокод КАК Промокод,
	|	Промокоды.Активен КАК Активен
	|ПОМЕСТИТЬ втПромокоды
	|ИЗ
	|	РегистрСведений.Промокоды КАК Промокоды
	|ГДЕ
	|	Промокоды.Владелец = &Клиент
	|	И Промокоды.Активен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСкидки.Скидка КАК Скидка,
	|	втСкидки.ДатаНачала КАК ДатаНачала,
	|	втСкидки.ДатаОкончания КАК ДатаОкончания,
	|	втСкидки.ТипПолучателя КАК ТипПолучателя,
	|	втСкидки.ТипСкидки КАК ТипСкидки,
	|	втСкидки.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
	|	втСкидки.СпособПредоставления КАК СпособПредоставления,
	|	втСкидки.Представление КАК Представление
	|ИЗ
	|	втСкидки КАК втСкидки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПромокоды КАК втПромокоды
	|		ПО втСкидки.Скидка.Промокод = втПромокоды.Вид
	|ГДЕ
	|	ВЫБОР
	|			КОГДА втСкидки.Скидка.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.БонусРефералу)
	|					И втСкидки.Скидка.НачислениеБонусами = ИСТИНА
	|				ТОГДА втПромокоды.Владелец = &Клиент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("Клиент"     ,Клиент);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция - Опредить тип скидки наценки это бонус
//
// Параметры:
//  СкидкаНаценкаСсылкаРодитель	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОпредитьТипСкидкиНаценкиЭтоБонус(СкидкаНаценкаСсылкаРодитель) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РодительЭлемента", СкидкаНаценкаСсылкаРодитель);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИСТИНА КАК ПризнакВхождения
	               |ГДЕ
	               |	&РодительЭлемента В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.Бонусы))";
	РезультатПризнаВхожденияВБонус = Запрос.Выполнить().Выбрать();
	
	Возврат РезультатПризнаВхожденияВБонус.Следующий();
	
КонецФункции

// Процедура, добавляет скидку переданному клиенту.
//
Процедура ДобавитьСкидкуКлиенту(ВыбраннаяСкидка, Клиент) Экспорт
	
	Если ВыбраннаяСкидка.ЭтоГруппа = Истина Тогда
		Возврат;
	Иначе
		
		СкидкаСуществует = ВыбраннаяСкидка.Получатели.Найти(Клиент, "Получатель"); 

		Если СкидкаСуществует = Неопределено Тогда
			
			// Получаем объект.
			СкидкаОбъект = ВыбраннаяСкидка.ПолучитьОбъект();
			
			// Добавляет клиента в эту скидку.
			СтрокаТЧ = СкидкаОбъект.Получатели.Добавить();
			СтрокаТЧ.Получатель = Клиент;
			
			Попытка
				СкидкаОбъект.Записать();
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
